# use GroupBy function

In [1]:
import numpy as np
import pandas as pd

In [2]:
data={"COMPANY":["GOOGLE","GOOGLE","FB","FB","MS","MS"],
    "PERSON":["HARDIK","VIVEK","KULDEEP","KAMYA","CHERRY","ROOP"],
    "SALES":[240,245,324,211,435,233]}

In [3]:
data=pd.DataFrame(data)
data

  COMPANY   PERSON  SALES
0  GOOGLE   HARDIK    240
1  GOOGLE    VIVEK    245
2      FB  KULDEEP    324
3      FB    KAMYA    211
4      MS   CHERRY    435
5      MS     ROOP    233

In [4]:
data.groupby("COMPANY").sum()

         SALES
COMPANY
FB         535
GOOGLE     485
MS         668

In [5]:
data.groupby("COMPANY").mean()

         SALES
COMPANY
FB       267.5
GOOGLE   242.5
MS       334.0

In [6]:
data.groupby("COMPANY").std()

              SALES
COMPANY
FB        79.903066
GOOGLE     3.535534
MS       142.835570

In [7]:
data.groupby("COMPANY").max()

          PERSON  SALES
COMPANY
FB       KULDEEP    324
GOOGLE     VIVEK    245
MS          ROOP    435